{
    "Topics": [
        {
            "Topic": "Communism",
            "Site": [
                {
                    "Title": "Communism",
                    "Url": "https://en.wikipedia.org/wiki/Communism",
                    "Pictures": ""
                }
            ]
        },
        {
            "Topic": "Communism",
            "Site": [
                {
                    "Title": "Worker cooperative",
                    "Summary": "A worker cooperative is a cooperative owned and self-managed by its workers. This control may mean a firm where every worker-owner participates in decision-making in a democratic fashion, or it may refer to one in which management is elected by every worker-owner who each have one vote.",
                    "Url": "https://en.wikipedia.org/wiki/Worker_cooperative",
                    "Pictures": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS3da5KuCSXpGbSP01h2fdOIIsChhQn7nH9X2b2uwsbDVqAiQd0WOQJlLgp9Q&s"
                }
            ]
        },
        {
            "Topic": "Abortion",
            "Site": [
                {
                    "Title": "Abortion",
                    "Summary": "Adoption is a process whereby a person assumes the parenting of another, usually a child, from that person's biological or legal parent or parents. Legal adoptions permanently transfer all rights and responsibilities, along with filiation, from the biological parent or parents.\nUnlike guardianship or other systems designed for the care of the young, adoption is intended to effect a permanent change in status and as such requires societal recognition, either through legal or religious sanction. Historically, some societies have enacted specific laws governing adoption, while others used less formal means (notably contracts that specified inheritance rights and parental responsibilities without an accompanying transfer of filiation). Modern systems of adoption, arising in the 20th century, tend to be governed by comprehensive statutes and regulations.~",
                    "Url": "https://en.wikipedia.org/wiki/Abortion",
                    "Pictures": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQHCOQIRJyZi8QrjcO-5C97weV4rb_fr8tQYSG3KCb4Ju8vfk_M8HAFphGkXKU&s"
                }
            ]
        },
        {
            "Topic": "Black Lives Matter",
            "Site": [
                {
                    "Title": "Black Lives Matter",
                    "Summary": "No Summary Available",
                    "Url": "https://en.wikipedia.org/wiki/Black_Lives_Matter",
                    "Pictures": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT0QOfeVniS-om6wzObQNZbrSKd1fvWThhwg8Q9Jb_7eaBilHMql8zfgqcIW5A&s"
                }
            ]
        },
        {
            "Topic": "Gun Control",
            "Site": [
                {
                    "Title": "Gun control",
                    "Summary": "Gun control (or firearms regulation) is the set of laws or policies that regulate the manufacture, sale, transfer, possession, modification, or use of firearms by civilians.\nMost countries have a restrictive firearm guiding policy, with only a few legislations being categorized as permissive. Jurisdictions that regulate access to firearms typically restrict access to only certain categories of firearms and then to restrict the categories of persons who will be granted a license to have access to a firearm. In some countries such as the United States, gun control may be legislated at either a federal level or a local state level.",
                    "Url": "https://en.wikipedia.org/wiki/Gun_Control",
                    "Pictures": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSleiaUqORAh8rzviLC_A-c6VYX5XwaqmI0NRXI8OK1NUCiyHr-ojo7QBuTLy8&s"
                }
            ]
        },
        {
            "Topic": "Climate Change",
            "Site": [
                {
                    "Title": "Climate change",
                    "Summary": "Climate change includes both global warming driven by human emissions of greenhouse gases and the resulting large-scale shifts in weather patterns. Though there have been previous periods of climatic change, since the mid-20th century humans have had an unprecedented impact on Earth's climate system and caused change on a global scale.The largest driver of warming is the emission of greenhouse gases, of which more than 90% are carbon dioxide (CO2) and methane. Fossil fuel burning (coal, oil, and natural gas) for energy consumption is the main source of these emissions, with additional contributions from agriculture, deforestation, and manufacturing.  The human cause of climate change is not disputed by any scientific body of national or international standing. Temperature rise is accelerated or tempered by climate feedbacks, such as loss of sunlight-reflecting snow and ice cover, increased water vapour (a greenhouse gas itself), and changes to land and ocean carbon sinks.\nTemperature rise on land is about twice the global average increase, leading to desert expansion and more common heat waves and wildfires. Temperature rise is also amplified in the Arctic, where it has contributed to melting permafrost, glacial retreat and sea ice loss. Warmer temperatures are increasing rates of evaporation, causing more intense storms and weather extremes. Impacts on ecosystems include the relocation or extinction of many species as their environment changes, most immediately in coral reefs, mountains, and the Arctic. Climate change threatens people with food insecurity, water scarcity, flooding, infectious diseases, extreme heat, economic losses, and displacement. These impacts have led the World Health Organization to call climate change the greatest threat to global health in the 21st century. Even if efforts to minimize future warming are successful, some effects will continue for centuries, including rising sea levels, rising ocean temperatures, and ocean acidification.\nMany of these impacts are already felt at the current level of warming, which is about 1.2 °C (2.2 °F). The Intergovernmental Panel on Climate Change (IPCC) has issued a series of reports that project significant increases in these impacts as warming continues to 1.5 °C (2.7 °F) and beyond. Additional warming also increases the risk of triggering critical thresholds called tipping points. Responding to climate change involves mitigation and adaptation. Mitigation – limiting climate change – consists of reducing greenhouse gas emissions and removing them from the atmosphere; methods include the development and deployment of low-carbon energy sources such as wind and solar, a phase-out of coal, enhanced energy efficiency, reforestation, and forest preservation. Adaptation consists of adjusting to actual or expected climate, such as through improved coastline protection, better disaster management, assisted colonization, and the development of more resistant crops. Adaptation alone cannot avert the risk of \"severe, widespread and irreversible\" impacts.Under the Paris Agreement, nations collectively agreed to keep warming \"well under 2.0 °C (3.6 °F)\" through mitigation efforts. However, with pledges made under the Agreement, global warming would still reach about 2.8 °C (5.0 °F) by the end of the century. Limiting warming to 1.5 °C (2.7 °F) would require halving emissions by 2030 and achieving near-zero emissions by 2050.",
                    "Url": "https://en.wikipedia.org/wiki/Climate_Change",
                    "Pictures": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRTFop5hppPgEy6P2B6r1KdKt2lCI5-9hog9t_Lvgkue7mw8Nr3kQhVdvaXkdQ&s"
                }
            ]
        },
        {
            "Topic": "Immigration",
            "Site": [
                {
                    "Title": "Immigration",
                    "Summary": "Immigration is the international movement of people to a destination country of which they are not natives or where they do not possess citizenship in order to settle as permanent residents or naturalized citizens. Commuters, tourists, and other short-term stays in a destination country do not fall under the definition of immigration or migration; seasonal labour immigration is sometimes included, however.\nAs for economic effects, research suggests that migration is beneficial both to the receiving and sending countries. Research, with few exceptions, finds that immigration on average has positive economic effects on the native population, but is mixed as to whether low-skilled immigration adversely affects low-skilled natives. Studies show that the elimination of barriers to migration would have profound effects on world GDP, with estimates of gains ranging between 67 and 147 percent. Development economists argue that reducing barriers to labor mobility between developing countries and developed countries would be one of the most efficient tools of poverty reduction. Positive net immigration can soften the demographic dilemma in the aging global North.The academic literature provides mixed findings for the relationship between immigration and crime worldwide, but finds for the United States that immigration either has no impact on the crime rate or that it reduces the crime rate. Research shows that country of origin matters for speed and depth of immigrant assimilation, but that there is considerable assimilation overall for both first- and second-generation immigrants.Research has found extensive evidence of discrimination against foreign born and minority populations in criminal justice, business, the economy, housing, health care, media, and politics in the United States and Europe.",
                    "Url": "https://en.wikipedia.org/wiki/Immigration",
                    "Pictures": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSWRgKxDDOIwXbOPzFoxr2HdinMzx2-vhG2N8swPeoz403W2xI6GoXcWvcvTgI&s"
                }
            ]
        },
        {
            "Topic": "Death Penalty",
            "Site": [
                {
                    "Title": "Death penalty (disambiguation)",
                    "Summary": "Capital punishment, also known as the death penalty, is the state-sanctioned killing of a person as punishment for a crime. The sentence ordering that someone is punished with the death penalty is called a death sentence, and the act of carrying out such a sentence is known as an execution. A prisoner awaiting their execution is condemned and is \"on death row\". Crimes that are punishable by death are known as capital crimes, capital offences or capital felonies, and vary depending on the jurisdiction, but commonly include serious crimes against the person such as murder, mass murder, aggravated cases of rape, child rape, child sexual abuse, terrorism, war crimes, crimes against humanity, and genocide, along with crimes against the state such as attempting to overthrow government, treason, espionage, sedition, piracy, and aircraft hijacking. Also, in some cases, acts of recidivism, aggravated robbery, and kidnapping, in addition to drug trafficking, drug dealing, and drug possession, are capital crimes or enhancements.\nEtymologically, the term capital (lit. \"of the head\", derived via the Latin capitalis from caput, \"head\") describes execution by beheading, but executions are carried out by many methods including hanging, shooting, lethal injection, stoning, electrocution and gassing.\nForty-eight countries retain capital punishment, 108 countries have completely abolished it de jure for all crimes, seven have abolished it for ordinary crimes (while maintaining it for special circumstances such as war crimes), and 28 are abolitionist in practice. Although most nations have abolished capital punishment, over 60% of the world's population live in countries where the death penalty is retained, such as China, India, the United States, Indonesia, Pakistan, Bangladesh, Nigeria, Egypt, Saudi Arabia, Iran, as well as in Japan and Taiwan.Capital punishment is controversial in several countries and states, and positions can vary within a single political ideology or cultural region. In the European Union (EU), Article 2 of the Charter of Fundamental Rights of the European Union prohibits the use of capital punishment. The Council of Europe, which has 47 member states, has sought to abolish the use of the death penalty by its members absolutely, through Protocol 13 of the European Convention on Human Rights. However, this only affects those member states which have signed and ratified it, and they do not include Armenia, Russia, and Azerbaijan. The United Nations General Assembly has adopted, throughout the years from 2007 to 2018, seven non-binding resolutions calling for a global moratorium on executions, with a view to eventual abolition.",
                    "Url": "https://en.wikipedia.org/wiki/Death_Penalty",
                    "Pictures": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRJ-M9k2i19uARLcAgPEhaPpYEmRclPkF5Wiwe0R6Nyv7Hbbxo5SdEnBU05IwI&s"
                }
            ]
        },
        {
            "Topic": "Torture",
            "Site": [
                {
                    "Title": "Torture",
                    "Summary": "Torture (from Latin tortus: to twist, to torment) is the act of deliberately inflicting severe physical or psychological suffering on someone by another as a punishment or in order to fulfill some desire of the torturer or force some action from the victim. Torture, by definition, is a knowing and intentional act; deeds which unknowingly or negligently inflict suffering or pain, without a specific intent to do so, are not typically considered torture.Torture has been carried out or sanctioned by individuals, groups, and states throughout history from ancient times to modern day, and forms of torture can vary greatly in duration from only a few minutes to several days or longer. Reasons for torture can include punishment, revenge, extortion, persuasion, political re-education, deterrence, coercion of the victim or a third party, interrogation to extract information or a confession irrespective of whether it is false, or simply the sadistic gratification of those carrying out or observing the torture. Alternatively, some forms of torture are designed to inflict psychological pain or leave as little physical injury or evidence as possible while achieving the same psychological devastation. The torturer may or may not kill or injure the victim, but torture may result in a deliberate death and serves as a form of capital punishment. Depending on the aim, even a form of torture that is intentionally fatal may be prolonged to allow the victim to suffer as long as possible (such as half-hanging). In other cases, the torturer may be indifferent to the condition of the victim.\nAlthough torture is sanctioned by some states, it is prohibited under international law and the domestic laws of most countries. Although widely illegal and reviled, there is an ongoing debate as to what exactly is and is not legally defined as torture. It is a serious violation of human rights, and is declared to be unacceptable (but not illegal) by Article 5 of the UN Universal Declaration of Human Rights. Signatories of the Geneva Conventions of 1949 and the Additional Protocols I and II of 8 June 1977 officially agree not to torture captured persons in armed conflicts, whether international or internal. Torture is also prohibited for the signatories of the United Nations Convention Against Torture, which has 163 state parties.National and international legal prohibitions on torture derive from a consensus that torture and similar ill-treatment are immoral, as well as impractical, and information obtained by torture is far less reliable than that obtained by other techniques. Despite these findings and international conventions, organizations that monitor abuses of human rights (e.g., Amnesty International, the International Rehabilitation Council for Torture Victims, Freedom from Torture, etc.) report widespread use condoned by states in many regions of the world. Amnesty International estimates that at least 81 world governments currently practice torture, some of them openly.",
                    "Url": "https://en.wikipedia.org/wiki/Torture",
                    "Pictures": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQltaJnGuvm04weY4eZqq--puYA5hY-t-rUwRpXPQJNXDhlqllcGD6rFVSmng&s"
                }
            ]
        },
        {
            "Topic": "Affirmative action",
            "Site": [
                {
                    "Title": "Affirmative action",
                    "Summary": "No Summary Available",
                    "Url": "https://en.wikipedia.org/wiki/Affirmative_action",
                    "Pictures": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcShHnX6RyQlL6PgfrcTpTyy2nYsXrUys3ZVgwDwIW3UsFVGLdwaLYv25CJtWEw&s"
                }
            ]
        },
        {
            "Topic": "defunding police",
            "Site": [
                {
                    "Title": "Defund the police",
                    "Summary": "\"Defund the police\" is a slogan that supports divesting funds from police departments and reallocating them to non-policing forms of public safety and community support, such as social services, youth services, housing, education, healthcare and other community resources. Activists who use the phrase may do so with varying intentions; some seek modest reductions, while others argue for full divestment as a step toward the abolition of contemporary police services. Activists that support the defunding of police departments often argue that investing in community programs could provide a better crime deterrent for communities; funds would go toward addressing social issues, like poverty, homelessness, and mental disorders. Police abolitionists call for replacing existing police forces with other systems of public safety, like housing, employment, community health, education, and other programs.The \"defund the police\" slogan became common during the George Floyd protests starting in May 2020. According to Jenna Wortham and Matthew Yglesias, the slogan was popularized by the Black Visions Collective shortly after the death of George Floyd.Black Lives Matter, Movement for Black Lives, and other activists have used the phrase to call for police budget reductions and to delegate certain police responsibilities to other organizations. In Black Reconstruction, first published in 1935, W. E. B. Du Bois wrote about \"abolition-democracy\", which advocated for the removal of institutions that were rooted in racist and repressive practices, including prisons, convict leasing, and white police forces. In the 1960s, activists such as Angela Davis advocated for the defunding or abolition of police departments. The 2017 book The End of Policing by Alex S. Vitale has been called \"... a manual of sorts for the defund movement.\"Some sociologists, criminologists, and journalists have criticized aspects of the police defunding movement. In the United States, politicians from both the Democratic and Republican parties have spoken against defunding, although Republicans have sought to link Democrats to the movement in congressional races. Among the general public in the United States, the concept of defunding is unpopular.",
                    "Url": "https://en.wikipedia.org/wiki/Defunding_police",
                    "Pictures": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRR65bckeoaVbDKf_MFngt1Y-eP6IpDNL5ZltqQJxgAFYRkfwJe_PXEL7eickU&s"
                }
            ]
        },
        {
            "Topic": "Fracking",
            "Site": [
                {
                    "Title": "Hydraulic fracturing",
                    "Summary": "No Summary Available",
                    "Url": "https://en.wikipedia.org/wiki/Fracking",
                    "Pictures": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQaGIoV_EakgvD7BKlnxgpxZzScsMA_yruK17NLKmgmxOktc_51huCCfqWAfg&s"
                }
            ]
        }
    ]
}